#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bund-dev/api-gateway/runs/run-omU1XPbMopKKoXAq

Waiting for the plan to start...

Terraform v1.0.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_repository.bundesrat_api_bund_dev_gh: Refreshing state... [id=bundesrat-api]
github_repository.polizei_brandenburg_api_bund_dev_gh: Refreshing state... [id=polizei-brandenburg-api]
github_repository.apis_api_bund_dev_gh: Refreshing state... [id=apis]
github_repository.bundestag_api_bund_dev_gh: Refreshing state... [id=bundestag-api]
github_repository.interpol_api_bund_dev_gh: Refreshing state... [id=interpol-api]
module.strahlenschutz_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=l4cm8bnava]
module.smard_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/f34a8fad-4235-4567-806b-4c6f352e6046]
module.risikogebiete_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/32c4c4e1-0468-42e8-a515-bf2db193b265]
module.strahlenschutz_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/3beac05b-d4be-41d0-b611-126dc6a8606b]
module.smard_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=7ho9gnokrf]
module.bundesrat_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/bd620c4e-04b3-4c4e-bb0b-6cb7fb33b90e]
module.dwd_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/bc12ea70-9284-4c49-ae80-ed4ec19895ed]
module.lebensmittelwarnung_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=aokp8p1hm1]
module.bundestag_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=3wx2npn2lc]
module.nina_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=6288qu3mta]
module.bundestag_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/bce050b2-d69a-49b2-8ab3-b560aa9211dd]
module.zoll_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=v46q8f816g]
module.polizei_brandenburg_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/55b90fc6-b7ad-4c8d-a595-378df898645d]
aws_elastic_beanstalk_application.strukturen_dev_app: Refreshing state... [id=strukturen-dev]
module.zoll_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/b8ca3a4d-c282-4265-8a7e-8ebf9e767b0f]
module.zoll_bmf_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=11frz7182m]
module.risikogebiete_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=t9a6cgwja8]
module.bundesrat_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=001mcc9zz1]
module.interpol_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=bmjjia2rw5]
module.nina_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/a96fd365-ea6c-475f-adfd-a7c476ce661e]
module.lebensmittelwarnung_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/98cf242a-7cee-4406-8e79-0e72f9606788]
module.interpol_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/83a630b9-8205-4f04-99e0-cd45c4e119af]
module.umweltbundesamt_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=3p9s6lb39i]
module.dwd_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=t3cfhiw784]
module.polizei_brandenburg_api_proxy.aws_apigatewayv2_api.api: Refreshing state... [id=mh34qq9035]
module.zoll_bmf_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/0f2c2216-a361-4025-815e-1de9b05f17d4]
module.umweltbundesamt_api_proxy.aws_acm_certificate.api_domain: Refreshing state... [id=arn:aws:acm:eu-central-1:889551677573:certificate/b5b3067f-a50b-436a-b5b8-0fbf2d987127]
module.lebensmittelwarnung_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.smard_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.strahlenschutz_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.bundestag_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.zoll_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.nina_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
aws_route53_record.interpol_red_notices_api_bund_dev: Refreshing state... [id=Z01225332CR1A1YNN1OLS_interpol.api_CNAME]
aws_route53_record.apis_api_bund_dev: Refreshing state... [id=Z01225332CR1A1YNN1OLS_api_CNAME]
aws_route53_record.status_bund_dev: Refreshing state... [id=Z01225332CR1A1YNN1OLS_status_CNAME]
aws_route53_record.polizei_brandenburg_api_bund_dev: Refreshing state... [id=Z01225332CR1A1YNN1OLS_polizei.brandenburg.api_CNAME]
aws_route53_record.mudab_api_bund_dev: Refreshing state... [id=Z01225332CR1A1YNN1OLS_mudab.api_CNAME]
aws_route53_record.lebensmittelwarnung_api_bund_dev: Refreshing state... [id=Z01225332CR1A1YNN1OLS_lebensmittelwarnung.api_CNAME]
aws_route53_record.bundestag_api_bund_dev: Refreshing state... [id=Z01225332CR1A1YNN1OLS_bundestag.api_CNAME]
aws_route53_record.bundesrat_api_bund_dev: Refreshing state... [id=Z01225332CR1A1YNN1OLS_bundesrat.api_CNAME]
module.zoll_bmf_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.risikogebiete_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.dwd_api_proxy.aws_route53_record.api_domain["dwd.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__2798659d161d4b61314abc34609e58c8.dwd.api.proxy.bund.dev._CNAME]
module.polizei_brandenburg_api_proxy.aws_route53_record.api_domain["polizei.brandenburg.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__2528ea8f3dd4f0d1b9154b6ab31db6d0.polizei.brandenburg.api.proxy.bund.dev._CNAME]
module.bundesrat_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.bundestag_api_proxy.aws_route53_record.api_domain["bundestag.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__30f1b0bffddf1297f8c751ce366f4d35.bundestag.api.proxy.bund.dev._CNAME]
module.interpol_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
aws_elastic_beanstalk_environment.strukturen_dev_env: Refreshing state... [id=e-2nmjbmabwc]
module.umweltbundesamt_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.dwd_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.nina_api_proxy.aws_route53_record.api_domain["nina.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__d4a57c1e8aaabfe5c58e619e4136be29.nina.api.proxy.bund.dev._CNAME]
module.polizei_brandenburg_api_proxy.aws_apigatewayv2_stage.api: Refreshing state... [id=prod]
module.lebensmittelwarnung_api_proxy.aws_route53_record.api_domain["lebensmittelwarnung.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__3ddc1f3c489abd589a1fee8187f2be60.lebensmittelwarnung.api.proxy.bund.dev._CNAME]
module.strahlenschutz_api_proxy.aws_route53_record.api_domain["strahlenschutz.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__23501972bd3642ae3d4654b7b855ff54.strahlenschutz.api.proxy.bund.dev._CNAME]
module.risikogebiete_api_proxy.aws_route53_record.api_domain["risikogebiete.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__a17fd9e7ac53152dfde0e8e1c6477ff1.risikogebiete.api.proxy.bund.dev._CNAME]
module.smard_api_proxy.aws_route53_record.api_domain["smard.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__1b245e20906893e6c07d7a142aba0050.smard.api.proxy.bund.dev._CNAME]
module.zoll_bmf_api_proxy.aws_route53_record.api_domain["zoll-bmf.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__8179d776087dcf9af8e8a23941f3653c.zoll-bmf.api.proxy.bund.dev._CNAME]
module.zoll_api_proxy.aws_route53_record.api_domain["zoll.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__990ad8cd70f296b8e4e9443db3b22c41.zoll.api.proxy.bund.dev._CNAME]
module.interpol_api_proxy.aws_route53_record.api_domain["interpol.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__4d6337f1681a7aa7e8b6e9fb8f00c87d.interpol.api.proxy.bund.dev._CNAME]
module.bundesrat_api_proxy.aws_route53_record.api_domain["bundesrat.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__44b46bb2299fc4f34348708c8cac8fa9.bundesrat.api.proxy.bund.dev._CNAME]
module.umweltbundesamt_api_proxy.aws_route53_record.api_domain["umweltbundesamt.api.proxy.bund.dev"]: Refreshing state... [id=Z01225332CR1A1YNN1OLS__b00f3e5ef2d342573e25d73aeb3730d2.umweltbundesamt.api.proxy.bund.dev._CNAME]
module.dwd_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-08-22 21:52:05 +0000 UTC]
module.polizei_brandenburg_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-09-05 11:56:49 +0000 UTC]
module.bundestag_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-09-05 11:57:05 +0000 UTC]
module.nina_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-08-22 17:43:25 +0000 UTC]
module.dwd_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=dwd.api.proxy.bund.dev]
module.bundestag_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=bundestag.api.proxy.bund.dev]
module.lebensmittelwarnung_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-08-28 07:45:18 +0000 UTC]
module.polizei_brandenburg_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=polizei.brandenburg.api.proxy.bund.dev]
module.strahlenschutz_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-08-22 14:13:03 +0000 UTC]
module.nina_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=nina.api.proxy.bund.dev]
module.risikogebiete_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-08-22 20:44:50 +0000 UTC]
module.bundesrat_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-09-05 11:57:05 +0000 UTC]
module.dwd_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_dwd.api.proxy.bund.dev_A]
module.dwd_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=qi65vb]
module.zoll_bmf_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-08-22 18:04:47 +0000 UTC]
module.interpol_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-09-05 11:56:45 +0000 UTC]
module.bundestag_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_bundestag.api.proxy.bund.dev_A]
module.bundestag_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=5ip84t]
module.zoll_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-08-22 18:04:35 +0000 UTC]
module.lebensmittelwarnung_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=lebensmittelwarnung.api.proxy.bund.dev]
module.polizei_brandenburg_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_polizei.brandenburg.api.proxy.bund.dev_A]
module.polizei_brandenburg_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=z1zi7v]
module.strahlenschutz_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=strahlenschutz.api.proxy.bund.dev]
module.nina_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_nina.api.proxy.bund.dev_A]
module.nina_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=n396a5]
module.risikogebiete_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=risikogebiete.api.proxy.bund.dev]
module.bundesrat_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=bundesrat.api.proxy.bund.dev]
module.zoll_bmf_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=zoll-bmf.api.proxy.bund.dev]
module.zoll_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=zoll.api.proxy.bund.dev]
module.interpol_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=interpol.api.proxy.bund.dev]
aws_route53_record.api_beta_strukturen_bund_dev: Refreshing state... [id=Z01225332CR1A1YNN1OLS_api.beta.strukturen_A]
module.lebensmittelwarnung_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_lebensmittelwarnung.api.proxy.bund.dev_A]
module.lebensmittelwarnung_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=c5qbtc]
module.strahlenschutz_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=6gg8vj]
module.strahlenschutz_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_strahlenschutz.api.proxy.bund.dev_A]
module.risikogebiete_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_risikogebiete.api.proxy.bund.dev_A]
module.risikogebiete_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=wiprwi]
module.bundesrat_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=ksiaru]
module.bundesrat_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_bundesrat.api.proxy.bund.dev_A]
module.zoll_bmf_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=gp1ch0]
module.zoll_bmf_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_zoll-bmf.api.proxy.bund.dev_A]
module.zoll_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=fyf28z]
module.zoll_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_zoll.api.proxy.bund.dev_A]
module.interpol_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_interpol.api.proxy.bund.dev_A]
module.interpol_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=zwef73]
module.smard_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-08-22 14:13:08 +0000 UTC]
module.smard_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=smard.api.proxy.bund.dev]
module.smard_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=q44v9j]
module.smard_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_smard.api.proxy.bund.dev_A]
module.umweltbundesamt_api_proxy.aws_acm_certificate_validation.api_domain: Refreshing state... [id=2021-08-22 19:33:51 +0000 UTC]
module.umweltbundesamt_api_proxy.aws_apigatewayv2_domain_name.api: Refreshing state... [id=umweltbundesamt.api.proxy.bund.dev]
module.umweltbundesamt_api_proxy.aws_apigatewayv2_api_mapping.api: Refreshing state... [id=ojmczx]
module.umweltbundesamt_api_proxy.aws_route53_record.api: Refreshing state... [id=Z01225332CR1A1YNN1OLS_umweltbundesamt.api.proxy.bund.dev_A]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_elastic_beanstalk_environment.strukturen_dev_env has been changed
  ~ resource "aws_elastic_beanstalk_environment" "strukturen_dev_env" {
      ~ all_settings           = [
          + {
              + name      = "ALLOWED_HOSTS"
              + namespace = "aws:elasticbeanstalk:application:environment"
              + resource  = ""
              + value     = ".elasticbeanstalk.com"
            },
          + {
              + name      = "ENVIRONMENT_TYPE"
              + namespace = "aws:elasticbeanstalk:application:environment"
              + resource  = ""
              + value     = "AWS"
            },
          - {
              - name      = "EnvironmentVariables"
              - namespace = "aws:cloudformation:template:parameter"
              - resource  = ""
              - value     = "PYTHONPATH=/var/app/venv/staging-LQM1lest/bin"
            },
          + {
              + name      = "EnvironmentVariables"
              + namespace = "aws:cloudformation:template:parameter"
              + resource  = ""
              + value     = "PYTHONPATH=/var/app/venv/staging-LQM1lest/bin,ALLOWED_HOSTS=.elasticbeanstalk.com,ENVIRONMENT_TYPE=AWS"
            },
          - {
              - name      = "NumProcesses"
              - namespace = "aws:elasticbeanstalk:container:python"
              - resource  = ""
              - value     = "1"
            },
          + {
              + name      = "NumProcesses"
              + namespace = "aws:elasticbeanstalk:container:python"
              + resource  = ""
              + value     = "3"
            },
          - {
              - name      = "NumThreads"
              - namespace = "aws:elasticbeanstalk:container:python"
              - resource  = ""
              - value     = "15"
            },
          + {
              + name      = "NumThreads"
              + namespace = "aws:elasticbeanstalk:container:python"
              + resource  = ""
              + value     = "20"
            },
          + {
              + name      = "Timeout"
              + namespace = "aws:elasticbeanstalk:command"
              + resource  = ""
              + value     = "3600"
            },
          - {
              - name      = "Timeout"
              - namespace = "aws:elasticbeanstalk:command"
              - resource  = ""
              - value     = "600"
            },
          - {
              - name      = "WSGIPath"
              - namespace = "aws:elasticbeanstalk:container:python"
              - resource  = ""
              - value     = "application"
            },
          + {
              + name      = "WSGIPath"
              + namespace = "aws:elasticbeanstalk:container:python"
              + resource  = ""
              + value     = "settings.wsgi:application"
            },
            # (116 unchanged elements hidden)
        ]
        id                     = "e-2nmjbmabwc"
        name                   = "strukturen"
        tags                   = {}
        # (14 unchanged attributes hidden)

      - setting {
          - name      = "AssociatePublicIpAddress" -> null
          - namespace = "aws:ec2:vpc" -> null
          - value     = "True" -> null
        }
      + setting {
          + name      = "AssociatePublicIpAddress"
          + namespace = "aws:ec2:vpc"
          + value     = "true"
        }
      + setting {
          + name      = "ELBScheme"
          + namespace = "aws:ec2:vpc"
          + value     = "internet facing"
        }
      - setting {
          - name      = "ELBScheme" -> null
          - namespace = "aws:ec2:vpc" -> null
          - value     = "internet facing" -> null
        }
      + setting {
          + name      = "IamInstanceProfile"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "aws-elasticbeanstalk-ec2-role"
        }
      - setting {
          - name      = "IamInstanceProfile" -> null
          - namespace = "aws:autoscaling:launchconfiguration" -> null
          - value     = "aws-elasticbeanstalk-ec2-role" -> null
        }
      + setting {
          + name      = "InstanceType"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "a1.medium"
        }
      - setting {
          - name      = "InstanceType" -> null
          - namespace = "aws:autoscaling:launchconfiguration" -> null
          - value     = "a1.medium" -> null
        }
      + setting {
          + name      = "LoadBalancerType"
          + namespace = "aws:elasticbeanstalk:environment"
          + value     = "application"
        }
      - setting {
          - name      = "LoadBalancerType" -> null
          - namespace = "aws:elasticbeanstalk:environment" -> null
          - value     = "application" -> null
        }
      + setting {
          + name      = "MatcherHTTPCode"
          + namespace = "aws:elasticbeanstalk:environment:process:default"
          + value     = "200"
        }
      - setting {
          - name      = "MatcherHTTPCode" -> null
          - namespace = "aws:elasticbeanstalk:environment:process:default" -> null
          - value     = "200" -> null
        }
      + setting {
          + name      = "MaxSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "4"
        }
      - setting {
          - name      = "MaxSize" -> null
          - namespace = "aws:autoscaling:asg" -> null
          - value     = "4" -> null
        }
      + setting {
          + name      = "MinSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "1"
        }
      - setting {
          - name      = "MinSize" -> null
          - namespace = "aws:autoscaling:asg" -> null
          - value     = "1" -> null
        }
      + setting {
          + name      = "Subnets"
          + namespace = "aws:ec2:vpc"
          + value     = "subnet-245d4559,subnet-ca74d6a0"
        }
      - setting {
          - name      = "Subnets" -> null
          - namespace = "aws:ec2:vpc" -> null
          - value     = "subnet-ca74d6a0,subnet-245d4559" -> null
        }
      + setting {
          + name      = "SystemType"
          + namespace = "aws:elasticbeanstalk:healthreporting:system"
          + value     = "enhanced"
        }
      - setting {
          - name      = "SystemType" -> null
          - namespace = "aws:elasticbeanstalk:healthreporting:system" -> null
          - value     = "enhanced" -> null
        }
      + setting {
          + name      = "VPCId"
          + namespace = "aws:ec2:vpc"
          + value     = "vpc-0ee31964"
        }
      - setting {
          - name      = "VPCId" -> null
          - namespace = "aws:ec2:vpc" -> null
          - value     = "vpc-0ee31964" -> null
        }
        # (6 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_elastic_beanstalk_environment.strukturen_dev_env will be updated in-place
  ~ resource "aws_elastic_beanstalk_environment" "strukturen_dev_env" {
      + cname_prefix           = ""
      + description            = ""
        id                     = "e-2nmjbmabwc"
        name                   = "strukturen"
        tags                   = {}
      + version_label          = ""
        # (15 unchanged attributes hidden)

      # Warning: this block will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ setting {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # aws_s3_bucket.strukturen_dev_assets will be created
  + resource "aws_s3_bucket" "strukturen_dev_assets" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "strukturen-bund-dev-assets"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "strukturen.bund.dev Assets"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```
</details>
*Pusher: @LilithWittmann, Action: `pull_request`*